#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=78034a915ae7e28245eef0578a8e8008174bc44c2af78c9ba4a469a398498927]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=1084986733]
data.azurerm_key_vault.secrets: Reading...
data.azurerm_key_vault.secrets: Read complete after 0s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
data.azurerm_key_vault_secret.vmpassword: Reading...
data.azurerm_key_vault_secret.vmpassword: Read complete after 2s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_monitor_diagnostic_categories.nsg_logs will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "nsg_logs" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # azurerm_log_analytics_workspace.law_platform will be created
  + resource "azurerm_log_analytics_workspace" "law_platform" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "swedencentral"
      + name                            = "law-platform"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-net-hub-001"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "Dev"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.nsg_router will be created
  + resource "azurerm_monitor_diagnostic_setting" "nsg_router" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "nsg_router_diag"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom will be created
  + resource "azurerm_network_connection_monitor" "spoke1vm_monitor_ubuntucom" {
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vm-spoke1-dev-001-ubuntucom"
      + network_watcher_id            = (known after apply)
      + notes                         = "spoke1vm-ubuntucom"
      + output_workspace_resource_ids = (known after apply)
      + tags                          = {
          + "environment" = "Dev"
        }

      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke1-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
            # (3 unchanged attributes hidden)
        }

      + test_configuration {
          + name                      = "tcp_80"
          + protocol                  = "Tcp"
          + test_frequency_in_seconds = 60
            # (1 unchanged attribute hidden)

          + tcp_configuration {
              + port                      = 80
              + trace_route_enabled       = true
                # (1 unchanged attribute hidden)
            }
        }

      + test_group {
          + destination_endpoints    = [
              + "archive.ubuntu.com",
            ]
          + enabled                  = true
          + name                     = "spoke1vm"
          + source_endpoints         = [
              + "vm-spoke1-dev-001",
            ]
          + test_configuration_names = [
              + "tcp_80",
            ]
        }
    }

  # azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom will be created
  + resource "azurerm_network_connection_monitor" "spoke2vm_monitor_ubuntucom" {
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vm-spoke2-dev-001-ubuntucom"
      + network_watcher_id            = (known after apply)
      + notes                         = "spoke2vm-ubuntucom"
      + output_workspace_resource_ids = (known after apply)
      + tags                          = {
          + "environment" = "Dev"
        }

      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke2-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
            # (3 unchanged attributes hidden)
        }

      + test_configuration {
          + name                      = "tcp_80"
          + protocol                  = "Tcp"
          + test_frequency_in_seconds = 60
            # (1 unchanged attribute hidden)

          + tcp_configuration {
              + port                      = 80
              + trace_route_enabled       = true
                # (1 unchanged attribute hidden)
            }
        }

      + test_group {
          + destination_endpoints    = [
              + "archive.ubuntu.com",
            ]
          + enabled                  = true
          + name                     = "spoke2vm"
          + source_endpoints         = [
              + "vm-spoke2-dev-001",
            ]
          + test_configuration_names = [
              + "tcp_80",
            ]
        }
    }

  # azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom will be created
  + resource "azurerm_network_connection_monitor" "ubunturoutervm_monitor_ubuntucom" {
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vm-hub-dev-001-ubuntucom"
      + network_watcher_id            = (known after apply)
      + notes                         = "ubunturoutervm-ubuntucom"
      + output_workspace_resource_ids = (known after apply)
      + tags                          = {
          + "environment" = "Dev"
        }

      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-hub-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
            # (3 unchanged attributes hidden)
        }

      + test_configuration {
          + name                      = "tcp_80"
          + protocol                  = "Tcp"
          + test_frequency_in_seconds = 60
            # (1 unchanged attribute hidden)

          + tcp_configuration {
              + port                      = 80
              + trace_route_enabled       = true
                # (1 unchanged attribute hidden)
            }
        }

      + test_group {
          + destination_endpoints    = [
              + "archive.ubuntu.com",
            ]
          + enabled                  = true
          + name                     = "ubunturoutervm"
          + source_endpoints         = [
              + "vm-hub-dev-001",
            ]
          + test_configuration_names = [
              + "tcp_80",
            ]
        }
    }

  # azurerm_network_security_group.nsg_router will be created
  + resource "azurerm_network_security_group" "nsg_router" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg_router"
      + resource_group_name = "rg-net-hub-001"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "123"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "NtpIn"
              + priority                                   = 1012
              + protocol                                   = "Udp"
              + source_address_prefix                      = "10.0.0.0/8"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "93.219.74.211/32"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HttpsIn"
              + priority                                   = 1011
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "10.0.0.0/8"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HttpIn"
              + priority                                   = 1010
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "10.0.0.0/8"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # azurerm_network_watcher.networkwatcher_hub will be created
  + resource "azurerm_network_watcher" "networkwatcher_hub" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "network-watcher-hub"
      + resource_group_name = "rg-net-hub-001"
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # azurerm_network_watcher_flow_log.hub will be created
  + resource "azurerm_network_watcher_flow_log" "hub" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "hub-flow"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "network-watcher-hub"
      + resource_group_name       = "rg-net-hub-001"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "Dev"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 14
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "swedencentral"
          + workspace_resource_id = (known after apply)
        }
    }

  # azurerm_network_watcher_flow_log.spoke1 will be created
  + resource "azurerm_network_watcher_flow_log" "spoke1" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "spoke1-flow"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "network-watcher-hub"
      + resource_group_name       = "rg-net-hub-001"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "Dev"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 14
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "swedencentral"
          + workspace_resource_id = (known after apply)
        }
    }

  # azurerm_network_watcher_flow_log.spoke2 will be created
  + resource "azurerm_network_watcher_flow_log" "spoke2" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "spoke2flow"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "network-watcher-hub"
      + resource_group_name       = "rg-net-hub-001"
      + storage_account_id        = (known after apply)
      + tags                      = {
          + "environment" = "Dev"
        }
      + target_resource_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 14
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = (known after apply)
          + workspace_region      = "swedencentral"
          + workspace_resource_id = (known after apply)
        }
    }

  # azurerm_resource_group.rg_compute will be created
  + resource "azurerm_resource_group" "rg_compute" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-compute-001"
      + tags     = {
          + "environment" = "Dev"
        }
    }

  # azurerm_resource_group.rg_hub will be created
  + resource "azurerm_resource_group" "rg_hub" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-net-hub-001"
      + tags     = {
          + "environment" = "Dev"
        }
    }

  # azurerm_storage_account.flow will be created
  + resource "azurerm_storage_account" "flow" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-net-hub-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "Dev"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_subnet.hub_subnet["RouterSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnet" {
      + address_prefixes                              = [
          + "10.0.0.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "RouterSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-net-hub-001"
      + virtual_network_name                          = "vnet-hub-001"
    }

  # azurerm_subnet_network_security_group_association.nsg_router-association will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_router-association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_machine_extension.spoke1vm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "spoke1vm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-spoke1-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "environment" = "Dev"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_machine_extension.spoke2vm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "spoke2vm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-spoke2-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "environment" = "Dev"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "ubunturoutervm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-hub-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "environment" = "Dev"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = (known after apply)
    }

  # azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet-hub-001"
      + resource_group_name = "rg-net-hub-001"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # random_id.id_flow will be created
  + resource "random_id" "id_flow" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.spoke1network.azurerm_resource_group.rg-spoke will be created
  + resource "azurerm_resource_group" "rg-spoke" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-spoke1-001"
      + tags     = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_route.default-route will be created
  + resource "azurerm_route" "default-route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default-route-entry"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-spoke1-001"
      + route_table_name       = "rt-vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_route_table.spoke-rt-table will be created
  + resource "azurerm_route_table" "spoke-rt-table" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "rt-vnet-spoke1-001"
      + resource_group_name           = "rg-spoke1-001"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.100.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "DatabaseTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1-001"
      + virtual_network_name                          = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.100.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "LogicTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1-001"
      + virtual_network_name                          = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.100.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "WebTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1-001"
      + virtual_network_name                          = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_virtual_network.vnet-spoke will be created
  + resource "azurerm_virtual_network" "vnet-spoke" {
      + address_space       = [
          + "10.100.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet-spoke1-001"
      + resource_group_name = "rg-spoke1-001"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_virtual_network_peering.hubspoke will be created
  + resource "azurerm_virtual_network_peering" "hubspoke" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-vnet-spoke1-001"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-net-hub-001"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hub-001"
    }

  # module.spoke1network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "vnet-spoke1-001-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-spoke1-001"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-spoke1-001"
    }

  # module.spoke2network.azurerm_resource_group.rg-spoke will be created
  + resource "azurerm_resource_group" "rg-spoke" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-spoke2-001"
      + tags     = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_route.default-route will be created
  + resource "azurerm_route" "default-route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default-route-entry"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-spoke2-001"
      + route_table_name       = "rt-vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_route_table.spoke-rt-table will be created
  + resource "azurerm_route_table" "spoke-rt-table" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "rt-vnet-spoke2-001"
      + resource_group_name           = "rg-spoke2-001"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.101.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "DatabaseTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke2-001"
      + virtual_network_name                          = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.101.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "LogicTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke2-001"
      + virtual_network_name                          = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                              = [
          + "10.101.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "WebTier"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke2-001"
      + virtual_network_name                          = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_virtual_network.vnet-spoke will be created
  + resource "azurerm_virtual_network" "vnet-spoke" {
      + address_space       = [
          + "10.101.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet-spoke2-001"
      + resource_group_name = "rg-spoke2-001"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_virtual_network_peering.hubspoke will be created
  + resource "azurerm_virtual_network_peering" "hubspoke" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-vnet-spoke2-001"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-net-hub-001"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hub-001"
    }

  # module.spoke2network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "vnet-spoke2-001-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-spoke2-001"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-spoke2-001"
    }

  # module.ubunturoutervm.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + ip_forwarding_enabled       = true
      + location                    = "swedencentral"
      + mac_address                 = (known after apply)
      + name                        = (known after apply)
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-compute-001"
      + tags                        = {
          + "environment" = "Dev"
        }
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-hub-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic will be created
  + resource "azurerm_public_ip" "pip_spokevmnic" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "pip-vm-hub-dev-001"
      + resource_group_name     = "rg-compute-001"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "Dev"
        }
    }

  # module.ubunturoutervm.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "Dev"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.ubunturoutervm.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-hub-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "environment" = "Dev"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk (known after apply)

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-hub-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubunturoutervm.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubunturoutervm.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubunturoutervm.random_id.randomid_pip will be created
  + resource "random_id" "randomid_pip" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubuntuspoke1.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke1.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke1.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "swedencentral"
      + mac_address                 = (known after apply)
      + name                        = (known after apply)
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-compute-001"
      + tags                        = {
          + "environment" = "Dev"
        }
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-spoke1-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubuntuspoke1.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "Dev"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.ubuntuspoke1.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke1-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "environment" = "Dev"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk (known after apply)

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke1-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubuntuspoke1.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubuntuspoke1.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubuntuspoke2.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke2.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke2.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "swedencentral"
      + mac_address                 = (known after apply)
      + name                        = (known after apply)
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-compute-001"
      + tags                        = {
          + "environment" = "Dev"
        }
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-spoke2-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubuntuspoke2.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "Dev"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "90.00:00:00"
        }

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.ubuntuspoke2.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke2-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "environment" = "Dev"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk (known after apply)

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke2-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubuntuspoke2.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubuntuspoke2.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 61 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + router_public_dns_fqdn = (known after apply)
  + router_public_ip       = (known after apply)
  + router_vm_private_ip   = (known after apply)
  + spoke1_vm_private_ip   = (known after apply)
  + spoke2_vm_private_ip   = (known after apply)
  + vm_username            = "azureuser"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*